# Список хранит просто значения
# Словарь хранит информацию обьекта

# student = {
#     "name": "Dias",
#     "age": 18,
#     "city": "Astana",
#     "isStudent": True,
# }

# student = {
#     "name": "Dias",
#     "age": 18,
# }
# # student["grade"] = 90 -> добавление элемента
# # student["age"]= 17 -> обновление данных
# # student.pop("age") -> удаление элемента
# print(student["name"])
# print(student.get("age", "Нет данных")) -> get -> безопасный способ получения данных. Работает как if/else, если 2 условия

# for i in student:
#     print(i)

# for i in student.values():
#     print(i)

# for key, value in student.items():
#     print(key, "-", value)
# .items -> сделать перебор по всему обьекту


# crud ->
# c - create
# r - read
# u - update
# d - delete

# user = {
#     "name": "Dias",
#     "age": 18,
#     "scores": {
#         "math": 90,
#         "python": 100,
#     }
# }
# print(user["scores"]["python"])



# 1.
# students ={
#     "Dias" : 100,
#     "Madina": 95,
#     "Aruzhan": 60
# }
# for name, score in students.items():
#     print(name, ":", score)

# # 2.
# best = max(students, key=students.get)
# print(best, students[best])

# pairs = [
#     ("Aruzhan", 16),
#     ("Dias", 17)
# ]
# pairs.append(("Aruzhan", 16))
# d = dict(pairs)
# for key, age in d.items():
#     print(key, "-", age)

# users = {
#     1: {"name": "Dias", "role": "admin"},
#     2: {"name": "Almas", "role": "user"}
# }
# for user_id, info in users.items():
#     print(f"ID: {user_id}, Name: {info["name"]}, Role: {info["role"]}")

# for i in users: ->Вызываем ключи
#     print(i)

# for i in users.values(): -> Вызываем переменные
#     print(i["name"])

# Уровень 1 — Лёгкие задачи (1–5)
# 1. Создайте словарь с именем и возрастом. Выведите возраст.
# Пример:
# {"name": "Aruzhan", "age": 17}
# list = {
#     "name": "Valeriy", 
#     "age": 22
# }
# print(list["age"])

# 2. Дан словарь. Измените значение ключа "age" на новое число.
# list = {
#     "name": "Valeriy", 
#     "age": 21
# }
# list["age"]=22
# print(list["age"])

# 3. Добавьте в словарь новый ключ "city" со значением.
# list = {
#     "name": "Valeriy", 
#     "age": 21
# }
# list["city"] = "Almaty"
# print("Город:", list["city"])

# 4. Удалите из словаря ключ "age".
# list = {
#     "name": "Valeriy", 
#     "age": 21,
#     "city": "Almaty"
# }
# list.pop("age")
# print(list)

# 5. Дан словарь из трёх предметов и баллов. Выведите все ключи и все значения.
# list = {
#     "math": 90, 
#     "python": 70,
#     "java": 80
# }
# for name, score in list.items():
#     print(name, "-", score)

# 🟧 Уровень 2 — Средние задачи (6–12)
# 6. Дан словарь из товаров: название → цена. Найдите самую дешёвую цену.
# list = {
#     "milk": 590, 
#     "egg": 1050,
#     "cola": 480
# }
# min = min(list, key=list.get)
# print(min, list[min])

# **7. Создайте словарь студентов: имя → балл.
# Выведите только тех, у кого балл ≥ 80.**
# students = {
#     "Valera": 85,
#     "Diana": 95,
#     "Ivan": 70,
#     "Alina": 65
# }
# for name, score in students.items():
#     if score >= 80:
#         print(name, "-", score)


# **8. Дан словарь {1: "a", 2: "b", 3: "c"}.
# Поменяйте местами ключи и значения.**
# change = {
#     1: "a",
#     2: "b", 
#     3: "c"
# }
# swapped = {
#     value: key for key, value in change.items()
#     }
# print(swapped)

# **9. Дан словарь пользователя.
# Если ключ "premium" отсутствует — добавьте его со значением False.**
# user = {
#     "name": "Dias",
#     "age": 20,
# }
# if "premium" not in user:
#     user["premium"] = False
# print(user)

# 10. Подсчитайте количество ключей в словаре без функции len().
# students = {
#     "Valera": 85,
#     "Diana": 95,
#     "Ivan": 70,
#     "Alina": 65
# }
# count=0
# for key, values in students.items():
#     count += 1
# print(count)

# **11. Дан словарь: товар → количество.
# Уменьшите количество товара на 1, если оно больше нуля.**
# fruits = {
#     "apple": 85,
#     "banana": 95,
#     "pineapple": 70,
#     "tomato": 65
# }
# for i in fruits:
#     if fruits[i] > 0:
#         fruits[i] -=1
# print(fruits)


# **12. Дан словарь с координатами точки:
# {"x": 10, "y": 20, "z": -5}
# Увеличьте каждую координату в 2 раза.**
# point = {
#     "x": 10, 
#     "y": 20, 
#     "z": -5
# }
# for key, nums in point.items():
#     nums *= 2
#     print(key, nums)


# 🟥 Уровень 3 — Сложные задачи (13–17)
# **13. Дан словарь учащихся: имя → список оценок.
# Найдите средний балл каждого ученика.**
# Пример:
# {"Dias": [90, 80], "Madina": [100, 95]}

# students = {
#     "Dias": [90, 80, 70], 
#     "Madina": [100, 95, 65],
#     "Aslan": [85, 97, 90]
# }
# for name, score in students.items():
#     average = sum(score)/len(score)
#     print(name, average)


# 14. Дан список слов. Подсчитайте частоту каждого слова с помощью словаря.
# Пример:
# ["apple", "banana", "apple"] → {"apple": 2, "banana": 1}
# list = ["apple", "banana", "apple", "banana", "onion", "apple"]
# list2 = {}

# for i in list:
#     list2[i]=list2.get(i, 0)+1
# print(list2)

# 15. Дан текст. Используя словарь, посчитайте частоту каждого символа.
# text = "hello world"
# dict3 = {}
# for i in text:
#     dict3[i] = dict3.get(i,0)+1
# print(dict3) 

# **16. Дан словарь пользователей: id → данные.
# Выведите имена всех пользователей с ролью “admin”.**
# user = {
#     "valera": "admin",
#     "diana": "admin",
#     "dias": "user",
#     "rasil": "manager"
# }
# for name, role in user.items():
#     if role == "admin":
#         print(name)

# **17. Дан словарь: категория → список товаров.
# Посчитайте общее количество всех товаров во всех категориях.**
# Пример:
# {"fruits": ["apple", "banana"], "cars": ["bmw"]} → 3
# list = {
#     "fruits": ["apple", "banana", "melon"], 
#     "cars": ["bmw", "audi", "mersedes", "porsche"]
# }
# total = 0
# for i in list.values():
#     total+=len(i)
# print(total)


# 🟪 Уровень 4 — Очень сложные задачи (18–20)
# Используют вложенные структуры, логику, обработку.
# **18. Дан список словарей (каждый словарь — ученик).
# Найдите ученика с максимальным средним баллом.**
# Пример:
# [
#   {"name": "Dias", "scores": [80, 90, 100]},
#   {"name": "Madina", "scores": [95, 90, 88]}
# ]

# **19. Дан словарь магазина: товар → {цена, количество}.
# Найти товар с максимальной стоимостью цена × количество.**

# **20. Дан словарь-задания: студент → {completed, total}.
# Для каждого студента посчитайте процент выполнения.
# Найдите того, у кого процент самый высокий.**
# Пример:
# {
#   "Dias": {"completed": 7, "total": 10},
#   "Madina": {"completed": 9, "total": 12}
# }