# МЕТОДЫ
# append(x) ->  добавить элемент в конец
# extend    ->  расширить список элемента другого списка через объект
# insert    ->  добавление элемента через индекс insert(index, значение)
# remove    ->  удаляет указанное значение из массива (НЕ ИНДЕКС)
# pop       ->  удаляет элемент по индексу
# clear     ->  удаляет значения внутри массива (НЕ МАССИВ)
# reverse   ->  поворачивает значения с конца на начало
# sort      ->  сортировка массива по условию
# copy      ->  копирует массив либо элемент

# append(x) -> добавить элемент в конец
# numbers = [1,5,9]
# numbers.append(23)
# print(numbers)

# extend -> расширить список элемента другого списка через объект
# a = [1,2,3]
# b = [4,5]
# a.extend(b)
# print(a) - добавляет Б в А
# print(b) - Б остается неизменным

# insert -> добавление элемента через индекс insert(index, значение)
# nums = [10, 20, 30]
# nums.insert(1, 15)
# nums.insert(0, "🍈")
# print(nums)

# remove - удаляет указанное значение из массива (НЕ ИНДЕКС)
# nums = [10, 20, 30, 40]
# nums.remove(20)
# print(nums)

# pop - удаляет элемент по индексу
# nums = [10, 20, 30, 40]
# nums.pop(0)
# print(nums)

# clear - удаляет значения внутри массива (НЕ МАССИВ)
# nums = [10, 20, 30, 40]
# nums.clear()
# print(nums)

# reverse - поворачивает значения с конца на начало
# nums = [10, 20, 30, 40]
# nums.reverse()
# print(nums)

# sort - сортировка массива по условию
# nums = [5, 2, 3, 1, 4]
# nums.sort()
# print(nums)

# names = ["Диас", "Бекжан", "Алия", "Валера"]
# names.sort()
# print(names)

# copy - копирует массив либо элемент
# original = [1, 2, 3]
# copy_massiv = original.copy()
# copy_massiv.append(4)
# print(copy_massiv)

# sum - находит сумму
# max, min




# a=[1,"qwe", True]
# b = a*3
# print (b)

# Данн список целых чисел которые нужно разложить в 3 списка
# отрицательные, положительные, нейстральные

# nums = [10, -9, -8, 0, 0, 23, -56, 11, 0, -1000, 228]
# positive =[]
# negative =[]
# neutral = []
# for i in nums:
#     if i < 0:
#         negative.append(i)
#     elif i == 0:
#         neutral.append(i)
#     else:
#         positive.append(i)
# print("Положительные: ", positive)
# print("Нейтральные: ", neutral)
# print("Негативные: ", negative)

# Дан список чисел. Удалить из него отрицательные элементы, изменяя сам список
# nums = [5, -3, 10, -7, 0, -1, 4]
# i =0
# while i < len(nums):
#     if nums[i]<0:
#         nums.pop(i)
#     else:
#         i+=1
# print(nums)

# Все нули должны "Уплыть в конец", порядок остальных чисел должен сохранится
# nums = [0, 5, 0, 3, 7, 0, 1, 2, 0, 9]
# result = []

# zero_count = nums.count(0)
# for i in nums:
#     if i != 0:
#         result.append(i)

# for j in range(zero_count):
#     result.append(0)
# print(result)

# Дома Доработать
# nums = [0, 5, 0, 3, 7, 0, 1, 2, 0, 9]

# for i in nums:
#     if nums[i] == 0:
#         nums.pop(i)
#         nums.append(0)

# print(nums)

# Есть список чисел, где нужно найти 3 самых больших балла, не меняя исходный список.

# nums = [70, 55, 40, 60, 80, 90, 50, 100]
# nums_copy = nums.copy()
# nums_copy.sort(reverse = True)
# top3 = nums_copy[:3]
# print("Исходный массив", nums)
# print("Топ 3", top3)

# Удалить все минимальные элементы

nums = [3, 1, 5, 1,7,8,20,1,2,5,6,7]
# Если мин значение встречается в массиве несколько раз, нужно удалить все такие элементы
min_val= min(nums)
while min_val in nums:
    nums.remove(min_val)
print(nums)