# # ДЗ1
# name=input("Введите имя: ")
# print("Привет, ", name, "! Добро пожаловать в Python!")

# name = input("Как вас зовут? ")
# item = input("Какой твой любимый предмет? ")
# print("Тебя зовут", name, "и ты любишь", item)

# film = input ("Какой твой любимый фильм? ")
# genre = input("Какой твой любимый жанр? ")
# print("Твой любимый фильм", film, "в жанре", genre)

# name=input("Введите имя: ")
# age=int(input("Введите возраст: "))
# city=input("Введите город: ")
# print("Привет,", name,"! Тебе", age,", и ты живёшь в городе", city)

# dream=input("Какая профессия тебя интересует? ")
# print("Класс! Желаю успехов, будущий", dream,"!")
