# Задание 1. Проверка температуры воздуха
# Попросите пользователя ввести температуру (целое число).
# Если температура больше 0 — вывести:
# На улице тепло ☀️
# Если 0 или меньше — вывести:
# На улице холодно ❄️

# Задание 1. Проверка температуры воздуха
# a=int(input("Введите температуру: "))
# if (a>0):
#     print("На улице тепло")
# else:   
#     print("На улице холодно")


# Задание 2. Проверка пароля
# Попросите пользователя ввести пароль.
# Если он равен "1234", вывести:
# Пароль верный! ✅
# Если другой — вывести:
# Ошибка! Неверный пароль! ❌

# Задание 2. Проверка пароля
# password=input("Введите пароль: ")
# if (password=="1234"):
#     print("Пароль верный!")
# else:   
#     print("Ошибка! Неверный пароль!")

# Задание 3. Проверка числа
# Пользователь вводит число.
# Если число больше 100 — вывести:
# Число больше 100 ✅
# Если меньше или равно 100 — вывести:
# Число не больше 100 ⚡

# Задание 3. Проверка числа
# a=int(input("Введите число: "))
# if (a>100):
#     print("Число больше 100")
# else:   
#     print("Число не больше 100")

# Задание 4. Проверка возраста
# Попросите пользователя ввести возраст.
# Если возраст меньше 18 — вывести:
# Вам нет 18. Доступ запрещён 🚫
# Если 18 и больше — вывести:
# Доступ разрешён ✅

# Задание 4. Проверка возраста
# age=int(input("Введите возраст: "))
# if (age<18):
#     print("Вам нет 18. Доступ запрещён")
# else:   
#     print("Доступ разрешён")

# Задание 5. Проверка чётности числа
# Попросите пользователя ввести число.
# Если число делится на 2 без остатка — вывести:
# Число <число> — чётное ✅
# Иначе — вывести:
# Число <число> — нечётное ⚡

# Подсказка: используйте оператор % и f-строку.

# Задание 5. Проверка чётности числа
# a=int(input("Введите число: "))
# if (a%2==0):
#     print(f"Число {a} — чётное")
# else:   
#     print(f"Число {a} — нечётное")